---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExportUtils..::..GetExportId Method
ExportUtils Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetExportId(Subelement) | Retrieves the GUID representing the subelement in DWF and IFC export. |
|  | GetExportId(Document, ElementId) | Retrieves the GUID representing this element in DWF and IFC export. |

# See Also

ExportUtils Class

ExportUtils Members

Autodesk.Revit.DB Namespace